Feature: Нанасяне на оценки

  Scenario: Нанасяне на оценка от съответния преподавател
    Given Преподавателя отваря екран за въвеждане на оценка
    When Преподавателя въведе предмет по който преподава "Биология"
    And Въведе предмет по който нанася оценка "Биология"
    And Въведе ученик с първо име "Иван" и фамилно име "Иванов"
    And Въведе оценка "6"
    And Натисна върху бутона за добавяне на оценката
    Then Вижда съобщение "Успешно въведохте оценката"

  Scenario: Нанасяне на оценка от грешен преподавател
    Given Преподавателя отваря екран за въвеждане на оценка
    When Преподавателя въведе предмет по който преподава "Химия"
    And Въведе предмет по който нанася оценка "Биология"
    And Въведе ученик с първо име "Иван" и фамилно име "Иванов"
    And Въведе оценка "6"
    And Натисна върху бутона за добавяне на оценката
    Then Вижда съобщение "Нямате право да добавяте оценки по този предмет"

  Scenario: Нанасяне на по-голяма оценка от съответния преподавател
    Given Преподавателя отваря екран за въвеждане на оценка
    When Преподавателя въведе предмет по който преподава "Биология"
    And Въведе предмет по който нанася оценка "Биология"
    And Въведе ученик с първо име "Иван" и фамилно име "Иванов"
    And Въведе оценка "7"
    And Натисна върху бутона за добавяне на оценката
    Then Вижда съобщение "Оценката е по-голяма от 6, въведете оценка между 2 и 6"

  Scenario: Нанасяне на по-малка оценка от съответния преподавател
    Given Преподавателя отваря екран за въвеждане на оценка
    When Преподавателя въведе предмет по който преподава "Биология"
    And Въведе предмет по който нанася оценка "Биология"
    And Въведе ученик с първо име "Иван" и фамилно име "Иванов"
    And Въведе оценка "1"
    And Натисна върху бутона за добавяне на оценката
    Then Вижда съобщение "Оценката е по-малка от 2, въведете оценка между 2 и 6"

  Scenario: Нанасяне на оценка с празно поле за оценка от съответния преподавател
    Given Преподавателя отваря екран за въвеждане на оценка
    When Преподавателя въведе предмет по който преподава "Биология"
    And Въведе предмет по който нанася оценка "Биология"
    And Въведе ученик с първо име "Иван" и фамилно име "Иванов"
    And Въведе оценка ""
    And Натисна върху бутона за добавяне на оценката
    Then Вижда съобщение "Полето за оценката е празно, въведете оценка между 2 и 6"